Revit 2024 API
DirectShape.TypeId Property
 Element id of a DirectShapeType object that holds properties to be shared by this element. Optional.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ElementId TypeId { get; }
Visual Basic
Public ReadOnly Property TypeId As ElementId
	Get
Visual C++
public:
property ElementId^ TypeId {
	ElementId^ get ();
}
See Also
DirectShape Class
Autodesk.Revit.DB Namespace